Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/include/component/intctrl.h
/*
 * Component description for INTCTRL
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-07-07T23:00:11Z */
#ifndef _PIC32CZCA90_INTCTRL_COMPONENT_H_
#define _PIC32CZCA90_INTCTRL_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR INTCTRL                                      */
/* ************************************************************************** */

/* -------- INTCTRL_STATL : (INTCTRL Offset: 0x00) ( R/ 32) Interrupt Status Register Low -------- */
#define INTCTRL_STATL_RESETVALUE              _UINT32_(0x00)                                       /*  (INTCTRL_STATL) Interrupt Status Register Low  Reset Value */

#define INTCTRL_STATL_RTC_Pos                 _UINT32_(0)                                          /* (INTCTRL_STATL) RTC Interrupt Position */
#define INTCTRL_STATL_RTC_Msk                 (_UINT32_(0x1) << INTCTRL_STATL_RTC_Pos)             /* (INTCTRL_STATL) RTC Interrupt Mask */
#define INTCTRL_STATL_RTC(value)              (INTCTRL_STATL_RTC_Msk & (_UINT32_(value) << INTCTRL_STATL_RTC_Pos)) /* Assigment of value for RTC in the INTCTRL_STATL register */
#define INTCTRL_STATL_TAMPER_Pos              _UINT32_(1)                                          /* (INTCTRL_STATL) Tamper Interrupt Position */
#define INTCTRL_STATL_TAMPER_Msk              (_UINT32_(0x1) << INTCTRL_STATL_TAMPER_Pos)          /* (INTCTRL_STATL) Tamper Interrupt Mask */
#define INTCTRL_STATL_TAMPER(value)           (INTCTRL_STATL_TAMPER_Msk & (_UINT32_(value) << INTCTRL_STATL_TAMPER_Pos)) /* Assigment of value for TAMPER in the INTCTRL_STATL register */
#define INTCTRL_STATL_EXTDMA_Pos              _UINT32_(2)                                          /* (INTCTRL_STATL) External DMA Interrupt Position */
#define INTCTRL_STATL_EXTDMA_Msk              (_UINT32_(0x1) << INTCTRL_STATL_EXTDMA_Pos)          /* (INTCTRL_STATL) External DMA Interrupt Mask */
#define INTCTRL_STATL_EXTDMA(value)           (INTCTRL_STATL_EXTDMA_Msk & (_UINT32_(value) << INTCTRL_STATL_EXTDMA_Pos)) /* Assigment of value for EXTDMA in the INTCTRL_STATL register */
#define INTCTRL_STATL_WDOG_Pos                _UINT32_(3)                                          /* (INTCTRL_STATL) Watch Dog Interrupt Position */
#define INTCTRL_STATL_WDOG_Msk                (_UINT32_(0x1) << INTCTRL_STATL_WDOG_Pos)            /* (INTCTRL_STATL) Watch Dog Interrupt Mask */
#define INTCTRL_STATL_WDOG(value)             (INTCTRL_STATL_WDOG_Msk & (_UINT32_(value) << INTCTRL_STATL_WDOG_Pos)) /* Assigment of value for WDOG in the INTCTRL_STATL register */
#define INTCTRL_STATL_TAMPER_BUSY_Pos         _UINT32_(5)                                          /* (INTCTRL_STATL) Tamper Busy Interrupt Position */
#define INTCTRL_STATL_TAMPER_BUSY_Msk         (_UINT32_(0x1) << INTCTRL_STATL_TAMPER_BUSY_Pos)     /* (INTCTRL_STATL) Tamper Busy Interrupt Mask */
#define INTCTRL_STATL_TAMPER_BUSY(value)      (INTCTRL_STATL_TAMPER_BUSY_Msk & (_UINT32_(value) << INTCTRL_STATL_TAMPER_BUSY_Pos)) /* Assigment of value for TAMPER_BUSY in the INTCTRL_STATL register */
#define INTCTRL_STATL_TIMER0_Pos              _UINT32_(6)                                          /* (INTCTRL_STATL) Timer 0 Interrupt Position */
#define INTCTRL_STATL_TIMER0_Msk              (_UINT32_(0x1) << INTCTRL_STATL_TIMER0_Pos)          /* (INTCTRL_STATL) Timer 0 Interrupt Mask */
#define INTCTRL_STATL_TIMER0(value)           (INTCTRL_STATL_TIMER0_Msk & (_UINT32_(value) << INTCTRL_STATL_TIMER0_Pos)) /* Assigment of value for TIMER0 in the INTCTRL_STATL register */
#define INTCTRL_STATL_TIMER1_Pos              _UINT32_(7)                                          /* (INTCTRL_STATL) Timer 1 interrupt Position */
#define INTCTRL_STATL_TIMER1_Msk              (_UINT32_(0x1) << INTCTRL_STATL_TIMER1_Pos)          /* (INTCTRL_STATL) Timer 1 interrupt Mask */
#define INTCTRL_STATL_TIMER1(value)           (INTCTRL_STATL_TIMER1_Msk & (_UINT32_(value) << INTCTRL_STATL_TIMER1_Pos)) /* Assigment of value for TIMER1 in the INTCTRL_STATL register */
#define INTCTRL_STATL_PWRDOWN_Pos             _UINT32_(11)                                         /* (INTCTRL_STATL) Power Down Interrupt Position */
#define INTCTRL_STATL_PWRDOWN_Msk             (_UINT32_(0x1) << INTCTRL_STATL_PWRDOWN_Pos)         /* (INTCTRL_STATL) Power Down Interrupt Mask */
#define INTCTRL_STATL_PWRDOWN(value)          (INTCTRL_STATL_PWRDOWN_Msk & (_UINT32_(value) << INTCTRL_STATL_PWRDOWN_Pos)) /* Assigment of value for PWRDOWN in the INTCTRL_STATL register */
#define INTCTRL_STATL_MB_TX_Pos               _UINT32_(14)                                         /* (INTCTRL_STATL) Mailbox TX Interrupt Position */
#define INTCTRL_STATL_MB_TX_Msk               (_UINT32_(0x1) << INTCTRL_STATL_MB_TX_Pos)           /* (INTCTRL_STATL) Mailbox TX Interrupt Mask */
#define INTCTRL_STATL_MB_TX(value)            (INTCTRL_STATL_MB_TX_Msk & (_UINT32_(value) << INTCTRL_STATL_MB_TX_Pos)) /* Assigment of value for MB_TX in the INTCTRL_STATL register */
#define INTCTRL_STATL_MB_RX_Pos               _UINT32_(15)                                         /* (INTCTRL_STATL) Mailbox RX Interrupt Position */
#define INTCTRL_STATL_MB_RX_Msk               (_UINT32_(0x1) << INTCTRL_STATL_MB_RX_Pos)           /* (INTCTRL_STATL) Mailbox RX Interrupt Mask */
#define INTCTRL_STATL_MB_RX(value)            (INTCTRL_STATL_MB_RX_Msk & (_UINT32_(value) << INTCTRL_STATL_MB_RX_Pos)) /* Assigment of value for MB_RX in the INTCTRL_STATL register */
#define INTCTRL_STATL_CRYPTO0_Pos             _UINT32_(16)                                         /* (INTCTRL_STATL) Crypto Interrupt 0 Position */
#define INTCTRL_STATL_CRYPTO0_Msk             (_UINT32_(0x1) << INTCTRL_STATL_CRYPTO0_Pos)         /* (INTCTRL_STATL) Crypto Interrupt 0 Mask */
#define INTCTRL_STATL_CRYPTO0(value)          (INTCTRL_STATL_CRYPTO0_Msk & (_UINT32_(value) << INTCTRL_STATL_CRYPTO0_Pos)) /* Assigment of value for CRYPTO0 in the INTCTRL_STATL register */
#define INTCTRL_STATL_CRYPTO1_Pos             _UINT32_(17)                                         /* (INTCTRL_STATL) Crypto Interrupt 1 Position */
#define INTCTRL_STATL_CRYPTO1_Msk             (_UINT32_(0x1) << INTCTRL_STATL_CRYPTO1_Pos)         /* (INTCTRL_STATL) Crypto Interrupt 1 Mask */
#define INTCTRL_STATL_CRYPTO1(value)          (INTCTRL_STATL_CRYPTO1_Msk & (_UINT32_(value) << INTCTRL_STATL_CRYPTO1_Pos)) /* Assigment of value for CRYPTO1 in the INTCTRL_STATL register */
#define INTCTRL_STATL_CRYPTO2_Pos             _UINT32_(18)                                         /* (INTCTRL_STATL) Crypto Interrupt 2 Position */
#define INTCTRL_STATL_CRYPTO2_Msk             (_UINT32_(0x1) << INTCTRL_STATL_CRYPTO2_Pos)         /* (INTCTRL_STATL) Crypto Interrupt 2 Mask */
#define INTCTRL_STATL_CRYPTO2(value)          (INTCTRL_STATL_CRYPTO2_Msk & (_UINT32_(value) << INTCTRL_STATL_CRYPTO2_Pos)) /* Assigment of value for CRYPTO2 in the INTCTRL_STATL register */
#define INTCTRL_STATL_CRYPTO3_Pos             _UINT32_(19)                                         /* (INTCTRL_STATL) Crypto Interrupt 3 Position */
#define INTCTRL_STATL_CRYPTO3_Msk             (_UINT32_(0x1) << INTCTRL_STATL_CRYPTO3_Pos)         /* (INTCTRL_STATL) Crypto Interrupt 3 Mask */
#define INTCTRL_STATL_CRYPTO3(value)          (INTCTRL_STATL_CRYPTO3_Msk & (_UINT32_(value) << INTCTRL_STATL_CRYPTO3_Pos)) /* Assigment of value for CRYPTO3 in the INTCTRL_STATL register */
#define INTCTRL_STATL_Msk                     _UINT32_(0x000FC8EF)                                 /* (INTCTRL_STATL) Register Mask  */

#define INTCTRL_STATL_TIMER_Pos               _UINT32_(6)                                          /* (INTCTRL_STATL Position) Timer x Interrupt */
#define INTCTRL_STATL_TIMER_Msk               (_UINT32_(0x3) << INTCTRL_STATL_TIMER_Pos)           /* (INTCTRL_STATL Mask) TIMER */
#define INTCTRL_STATL_TIMER(value)            (INTCTRL_STATL_TIMER_Msk & (_UINT32_(value) << INTCTRL_STATL_TIMER_Pos)) 
#define INTCTRL_STATL_CRYPTO_Pos              _UINT32_(16)                                         /* (INTCTRL_STATL Position) Crypto Interrupt 3 */
#define INTCTRL_STATL_CRYPTO_Msk              (_UINT32_(0xF) << INTCTRL_STATL_CRYPTO_Pos)          /* (INTCTRL_STATL Mask) CRYPTO */
#define INTCTRL_STATL_CRYPTO(value)           (INTCTRL_STATL_CRYPTO_Msk & (_UINT32_(value) << INTCTRL_STATL_CRYPTO_Pos)) 

/* -------- INTCTRL_RSRL : (INTCTRL Offset: 0x08) (R/W 32) Interrupt Raw Status Register Low -------- */
#define INTCTRL_RSRL_RESETVALUE               _UINT32_(0x00)                                       /*  (INTCTRL_RSRL) Interrupt Raw Status Register Low  Reset Value */

#define INTCTRL_RSRL_RTC_Pos                  _UINT32_(0)                                          /* (INTCTRL_RSRL) RTC Interrupt Position */
#define INTCTRL_RSRL_RTC_Msk                  (_UINT32_(0x1) << INTCTRL_RSRL_RTC_Pos)              /* (INTCTRL_RSRL) RTC Interrupt Mask */
#define INTCTRL_RSRL_RTC(value)               (INTCTRL_RSRL_RTC_Msk & (_UINT32_(value) << INTCTRL_RSRL_RTC_Pos)) /* Assigment of value for RTC in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_TAMPER_Pos               _UINT32_(1)                                          /* (INTCTRL_RSRL) Tamper Interrupt Position */
#define INTCTRL_RSRL_TAMPER_Msk               (_UINT32_(0x1) << INTCTRL_RSRL_TAMPER_Pos)           /* (INTCTRL_RSRL) Tamper Interrupt Mask */
#define INTCTRL_RSRL_TAMPER(value)            (INTCTRL_RSRL_TAMPER_Msk & (_UINT32_(value) << INTCTRL_RSRL_TAMPER_Pos)) /* Assigment of value for TAMPER in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_EXTDMA_Pos               _UINT32_(2)                                          /* (INTCTRL_RSRL) External DMA Interrupt Position */
#define INTCTRL_RSRL_EXTDMA_Msk               (_UINT32_(0x1) << INTCTRL_RSRL_EXTDMA_Pos)           /* (INTCTRL_RSRL) External DMA Interrupt Mask */
#define INTCTRL_RSRL_EXTDMA(value)            (INTCTRL_RSRL_EXTDMA_Msk & (_UINT32_(value) << INTCTRL_RSRL_EXTDMA_Pos)) /* Assigment of value for EXTDMA in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_WDOG_Pos                 _UINT32_(3)                                          /* (INTCTRL_RSRL) Watch Dog Interrupt Position */
#define INTCTRL_RSRL_WDOG_Msk                 (_UINT32_(0x1) << INTCTRL_RSRL_WDOG_Pos)             /* (INTCTRL_RSRL) Watch Dog Interrupt Mask */
#define INTCTRL_RSRL_WDOG(value)              (INTCTRL_RSRL_WDOG_Msk & (_UINT32_(value) << INTCTRL_RSRL_WDOG_Pos)) /* Assigment of value for WDOG in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_TAMPER_BUSY_Pos          _UINT32_(5)                                          /* (INTCTRL_RSRL) Tamper Busy Interrupt Position */
#define INTCTRL_RSRL_TAMPER_BUSY_Msk          (_UINT32_(0x1) << INTCTRL_RSRL_TAMPER_BUSY_Pos)      /* (INTCTRL_RSRL) Tamper Busy Interrupt Mask */
#define INTCTRL_RSRL_TAMPER_BUSY(value)       (INTCTRL_RSRL_TAMPER_BUSY_Msk & (_UINT32_(value) << INTCTRL_RSRL_TAMPER_BUSY_Pos)) /* Assigment of value for TAMPER_BUSY in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_TIMER0_Pos               _UINT32_(6)                                          /* (INTCTRL_RSRL) Timer 0 Interrupt Position */
#define INTCTRL_RSRL_TIMER0_Msk               (_UINT32_(0x1) << INTCTRL_RSRL_TIMER0_Pos)           /* (INTCTRL_RSRL) Timer 0 Interrupt Mask */
#define INTCTRL_RSRL_TIMER0(value)            (INTCTRL_RSRL_TIMER0_Msk & (_UINT32_(value) << INTCTRL_RSRL_TIMER0_Pos)) /* Assigment of value for TIMER0 in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_TIMER1_Pos               _UINT32_(7)                                          /* (INTCTRL_RSRL) Timer 1 interrupt Position */
#define INTCTRL_RSRL_TIMER1_Msk               (_UINT32_(0x1) << INTCTRL_RSRL_TIMER1_Pos)           /* (INTCTRL_RSRL) Timer 1 interrupt Mask */
#define INTCTRL_RSRL_TIMER1(value)            (INTCTRL_RSRL_TIMER1_Msk & (_UINT32_(value) << INTCTRL_RSRL_TIMER1_Pos)) /* Assigment of value for TIMER1 in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_PWRDOWN_Pos              _UINT32_(11)                                         /* (INTCTRL_RSRL) Power Down Interrupt Position */
#define INTCTRL_RSRL_PWRDOWN_Msk              (_UINT32_(0x1) << INTCTRL_RSRL_PWRDOWN_Pos)          /* (INTCTRL_RSRL) Power Down Interrupt Mask */
#define INTCTRL_RSRL_PWRDOWN(value)           (INTCTRL_RSRL_PWRDOWN_Msk & (_UINT32_(value) << INTCTRL_RSRL_PWRDOWN_Pos)) /* Assigment of value for PWRDOWN in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_MB_TX_Pos                _UINT32_(14)                                         /* (INTCTRL_RSRL) Mailbox TX Interrupt Position */
#define INTCTRL_RSRL_MB_TX_Msk                (_UINT32_(0x1) << INTCTRL_RSRL_MB_TX_Pos)            /* (INTCTRL_RSRL) Mailbox TX Interrupt Mask */
#define INTCTRL_RSRL_MB_TX(value)             (INTCTRL_RSRL_MB_TX_Msk & (_UINT32_(value) << INTCTRL_RSRL_MB_TX_Pos)) /* Assigment of value for MB_TX in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_MB_RX_Pos                _UINT32_(15)                                         /* (INTCTRL_RSRL) Mailbox RX Interrupt Position */
#define INTCTRL_RSRL_MB_RX_Msk                (_UINT32_(0x1) << INTCTRL_RSRL_MB_RX_Pos)            /* (INTCTRL_RSRL) Mailbox RX Interrupt Mask */
#define INTCTRL_RSRL_MB_RX(value)             (INTCTRL_RSRL_MB_RX_Msk & (_UINT32_(value) << INTCTRL_RSRL_MB_RX_Pos)) /* Assigment of value for MB_RX in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_CRYPTO0_Pos              _UINT32_(16)                                         /* (INTCTRL_RSRL) Crypto Interrupt 0 Position */
#define INTCTRL_RSRL_CRYPTO0_Msk              (_UINT32_(0x1) << INTCTRL_RSRL_CRYPTO0_Pos)          /* (INTCTRL_RSRL) Crypto Interrupt 0 Mask */
#define INTCTRL_RSRL_CRYPTO0(value)           (INTCTRL_RSRL_CRYPTO0_Msk & (_UINT32_(value) << INTCTRL_RSRL_CRYPTO0_Pos)) /* Assigment of value for CRYPTO0 in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_CRYPTO1_Pos              _UINT32_(17)                                         /* (INTCTRL_RSRL) Crypto Interrupt 1 Position */
#define INTCTRL_RSRL_CRYPTO1_Msk              (_UINT32_(0x1) << INTCTRL_RSRL_CRYPTO1_Pos)          /* (INTCTRL_RSRL) Crypto Interrupt 1 Mask */
#define INTCTRL_RSRL_CRYPTO1(value)           (INTCTRL_RSRL_CRYPTO1_Msk & (_UINT32_(value) << INTCTRL_RSRL_CRYPTO1_Pos)) /* Assigment of value for CRYPTO1 in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_CRYPTO2_Pos              _UINT32_(18)                                         /* (INTCTRL_RSRL) Crypto Interrupt 2 Position */
#define INTCTRL_RSRL_CRYPTO2_Msk              (_UINT32_(0x1) << INTCTRL_RSRL_CRYPTO2_Pos)          /* (INTCTRL_RSRL) Crypto Interrupt 2 Mask */
#define INTCTRL_RSRL_CRYPTO2(value)           (INTCTRL_RSRL_CRYPTO2_Msk & (_UINT32_(value) << INTCTRL_RSRL_CRYPTO2_Pos)) /* Assigment of value for CRYPTO2 in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_CRYPTO3_Pos              _UINT32_(19)                                         /* (INTCTRL_RSRL) Crypto Interrupt 3 Position */
#define INTCTRL_RSRL_CRYPTO3_Msk              (_UINT32_(0x1) << INTCTRL_RSRL_CRYPTO3_Pos)          /* (INTCTRL_RSRL) Crypto Interrupt 3 Mask */
#define INTCTRL_RSRL_CRYPTO3(value)           (INTCTRL_RSRL_CRYPTO3_Msk & (_UINT32_(value) << INTCTRL_RSRL_CRYPTO3_Pos)) /* Assigment of value for CRYPTO3 in the INTCTRL_RSRL register */
#define INTCTRL_RSRL_Msk                      _UINT32_(0x000FC8EF)                                 /* (INTCTRL_RSRL) Register Mask  */

