Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/include/component/intctrl.h
#define INTCTRL_TSTL_TIMER_Pos                _UINT32_(6)                                          /* (INTCTRL_TSTL Position) Timer x Interrupt */
#define INTCTRL_TSTL_TIMER_Msk                (_UINT32_(0x3) << INTCTRL_TSTL_TIMER_Pos)            /* (INTCTRL_TSTL Mask) TIMER */
#define INTCTRL_TSTL_TIMER(value)             (INTCTRL_TSTL_TIMER_Msk & (_UINT32_(value) << INTCTRL_TSTL_TIMER_Pos)) 
#define INTCTRL_TSTL_CRYPTO_Pos               _UINT32_(16)                                         /* (INTCTRL_TSTL Position) Crypto Interrupt 3 */
#define INTCTRL_TSTL_CRYPTO_Msk               (_UINT32_(0xF) << INTCTRL_TSTL_CRYPTO_Pos)           /* (INTCTRL_TSTL Mask) CRYPTO */
#define INTCTRL_TSTL_CRYPTO(value)            (INTCTRL_TSTL_CRYPTO_Msk & (_UINT32_(value) << INTCTRL_TSTL_CRYPTO_Pos)) 

/* -------- INTCTRL_SELL : (INTCTRL Offset: 0x28) (R/W 32) Interrupt Source Selection Register Low -------- */
#define INTCTRL_SELL_RESETVALUE               _UINT32_(0x00)                                       /*  (INTCTRL_SELL) Interrupt Source Selection Register Low  Reset Value */

#define INTCTRL_SELL_RTC_Pos                  _UINT32_(0)                                          /* (INTCTRL_SELL) RTC Interrupt Position */
#define INTCTRL_SELL_RTC_Msk                  (_UINT32_(0x1) << INTCTRL_SELL_RTC_Pos)              /* (INTCTRL_SELL) RTC Interrupt Mask */
#define INTCTRL_SELL_RTC(value)               (INTCTRL_SELL_RTC_Msk & (_UINT32_(value) << INTCTRL_SELL_RTC_Pos)) /* Assigment of value for RTC in the INTCTRL_SELL register */
#define INTCTRL_SELL_TAMPER_Pos               _UINT32_(1)                                          /* (INTCTRL_SELL) Tamper Interrupt Position */
#define INTCTRL_SELL_TAMPER_Msk               (_UINT32_(0x1) << INTCTRL_SELL_TAMPER_Pos)           /* (INTCTRL_SELL) Tamper Interrupt Mask */
#define INTCTRL_SELL_TAMPER(value)            (INTCTRL_SELL_TAMPER_Msk & (_UINT32_(value) << INTCTRL_SELL_TAMPER_Pos)) /* Assigment of value for TAMPER in the INTCTRL_SELL register */
#define INTCTRL_SELL_EXTDMA_Pos               _UINT32_(2)                                          /* (INTCTRL_SELL) External DMA Interrupt Position */
#define INTCTRL_SELL_EXTDMA_Msk               (_UINT32_(0x1) << INTCTRL_SELL_EXTDMA_Pos)           /* (INTCTRL_SELL) External DMA Interrupt Mask */
#define INTCTRL_SELL_EXTDMA(value)            (INTCTRL_SELL_EXTDMA_Msk & (_UINT32_(value) << INTCTRL_SELL_EXTDMA_Pos)) /* Assigment of value for EXTDMA in the INTCTRL_SELL register */
#define INTCTRL_SELL_WDOG_Pos                 _UINT32_(3)                                          /* (INTCTRL_SELL) Watch Dog Interrupt Position */
#define INTCTRL_SELL_WDOG_Msk                 (_UINT32_(0x1) << INTCTRL_SELL_WDOG_Pos)             /* (INTCTRL_SELL) Watch Dog Interrupt Mask */
#define INTCTRL_SELL_WDOG(value)              (INTCTRL_SELL_WDOG_Msk & (_UINT32_(value) << INTCTRL_SELL_WDOG_Pos)) /* Assigment of value for WDOG in the INTCTRL_SELL register */
#define INTCTRL_SELL_TAMPER_BUSY_Pos          _UINT32_(5)                                          /* (INTCTRL_SELL) Tamper Busy Interrupt Position */
#define INTCTRL_SELL_TAMPER_BUSY_Msk          (_UINT32_(0x1) << INTCTRL_SELL_TAMPER_BUSY_Pos)      /* (INTCTRL_SELL) Tamper Busy Interrupt Mask */
#define INTCTRL_SELL_TAMPER_BUSY(value)       (INTCTRL_SELL_TAMPER_BUSY_Msk & (_UINT32_(value) << INTCTRL_SELL_TAMPER_BUSY_Pos)) /* Assigment of value for TAMPER_BUSY in the INTCTRL_SELL register */
#define INTCTRL_SELL_TIMER0_Pos               _UINT32_(6)                                          /* (INTCTRL_SELL) Timer 0 Interrupt Position */
#define INTCTRL_SELL_TIMER0_Msk               (_UINT32_(0x1) << INTCTRL_SELL_TIMER0_Pos)           /* (INTCTRL_SELL) Timer 0 Interrupt Mask */
#define INTCTRL_SELL_TIMER0(value)            (INTCTRL_SELL_TIMER0_Msk & (_UINT32_(value) << INTCTRL_SELL_TIMER0_Pos)) /* Assigment of value for TIMER0 in the INTCTRL_SELL register */
#define INTCTRL_SELL_TIMER1_Pos               _UINT32_(7)                                          /* (INTCTRL_SELL) Timer 1 interrupt Position */
#define INTCTRL_SELL_TIMER1_Msk               (_UINT32_(0x1) << INTCTRL_SELL_TIMER1_Pos)           /* (INTCTRL_SELL) Timer 1 interrupt Mask */
#define INTCTRL_SELL_TIMER1(value)            (INTCTRL_SELL_TIMER1_Msk & (_UINT32_(value) << INTCTRL_SELL_TIMER1_Pos)) /* Assigment of value for TIMER1 in the INTCTRL_SELL register */
#define INTCTRL_SELL_PWRDOWN_Pos              _UINT32_(11)                                         /* (INTCTRL_SELL) Power Down Interrupt Position */
#define INTCTRL_SELL_PWRDOWN_Msk              (_UINT32_(0x1) << INTCTRL_SELL_PWRDOWN_Pos)          /* (INTCTRL_SELL) Power Down Interrupt Mask */
#define INTCTRL_SELL_PWRDOWN(value)           (INTCTRL_SELL_PWRDOWN_Msk & (_UINT32_(value) << INTCTRL_SELL_PWRDOWN_Pos)) /* Assigment of value for PWRDOWN in the INTCTRL_SELL register */
#define INTCTRL_SELL_MB_TX_Pos                _UINT32_(14)                                         /* (INTCTRL_SELL) Mailbox TX Interrupt Position */
#define INTCTRL_SELL_MB_TX_Msk                (_UINT32_(0x1) << INTCTRL_SELL_MB_TX_Pos)            /* (INTCTRL_SELL) Mailbox TX Interrupt Mask */
#define INTCTRL_SELL_MB_TX(value)             (INTCTRL_SELL_MB_TX_Msk & (_UINT32_(value) << INTCTRL_SELL_MB_TX_Pos)) /* Assigment of value for MB_TX in the INTCTRL_SELL register */
#define INTCTRL_SELL_MB_RX_Pos                _UINT32_(15)                                         /* (INTCTRL_SELL) Mailbox RX Interrupt Position */
#define INTCTRL_SELL_MB_RX_Msk                (_UINT32_(0x1) << INTCTRL_SELL_MB_RX_Pos)            /* (INTCTRL_SELL) Mailbox RX Interrupt Mask */
#define INTCTRL_SELL_MB_RX(value)             (INTCTRL_SELL_MB_RX_Msk & (_UINT32_(value) << INTCTRL_SELL_MB_RX_Pos)) /* Assigment of value for MB_RX in the INTCTRL_SELL register */
#define INTCTRL_SELL_CRYPTO0_Pos              _UINT32_(16)                                         /* (INTCTRL_SELL) Crypto Interrupt 0 Position */
#define INTCTRL_SELL_CRYPTO0_Msk              (_UINT32_(0x1) << INTCTRL_SELL_CRYPTO0_Pos)          /* (INTCTRL_SELL) Crypto Interrupt 0 Mask */
#define INTCTRL_SELL_CRYPTO0(value)           (INTCTRL_SELL_CRYPTO0_Msk & (_UINT32_(value) << INTCTRL_SELL_CRYPTO0_Pos)) /* Assigment of value for CRYPTO0 in the INTCTRL_SELL register */
#define INTCTRL_SELL_CRYPTO1_Pos              _UINT32_(17)                                         /* (INTCTRL_SELL) Crypto Interrupt 1 Position */
#define INTCTRL_SELL_CRYPTO1_Msk              (_UINT32_(0x1) << INTCTRL_SELL_CRYPTO1_Pos)          /* (INTCTRL_SELL) Crypto Interrupt 1 Mask */
#define INTCTRL_SELL_CRYPTO1(value)           (INTCTRL_SELL_CRYPTO1_Msk & (_UINT32_(value) << INTCTRL_SELL_CRYPTO1_Pos)) /* Assigment of value for CRYPTO1 in the INTCTRL_SELL register */
#define INTCTRL_SELL_CRYPTO2_Pos              _UINT32_(18)                                         /* (INTCTRL_SELL) Crypto Interrupt 2 Position */
#define INTCTRL_SELL_CRYPTO2_Msk              (_UINT32_(0x1) << INTCTRL_SELL_CRYPTO2_Pos)          /* (INTCTRL_SELL) Crypto Interrupt 2 Mask */
#define INTCTRL_SELL_CRYPTO2(value)           (INTCTRL_SELL_CRYPTO2_Msk & (_UINT32_(value) << INTCTRL_SELL_CRYPTO2_Pos)) /* Assigment of value for CRYPTO2 in the INTCTRL_SELL register */
#define INTCTRL_SELL_CRYPTO3_Pos              _UINT32_(19)                                         /* (INTCTRL_SELL) Crypto Interrupt 3 Position */
#define INTCTRL_SELL_CRYPTO3_Msk              (_UINT32_(0x1) << INTCTRL_SELL_CRYPTO3_Pos)          /* (INTCTRL_SELL) Crypto Interrupt 3 Mask */
#define INTCTRL_SELL_CRYPTO3(value)           (INTCTRL_SELL_CRYPTO3_Msk & (_UINT32_(value) << INTCTRL_SELL_CRYPTO3_Pos)) /* Assigment of value for CRYPTO3 in the INTCTRL_SELL register */
#define INTCTRL_SELL_Msk                      _UINT32_(0x000FC8EF)                                 /* (INTCTRL_SELL) Register Mask  */

