Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/include/component/intctrl.h
#define INTCTRL_SELL_TIMER_Pos                _UINT32_(6)                                          /* (INTCTRL_SELL Position) Timer x Interrupt */
#define INTCTRL_SELL_TIMER_Msk                (_UINT32_(0x3) << INTCTRL_SELL_TIMER_Pos)            /* (INTCTRL_SELL Mask) TIMER */
#define INTCTRL_SELL_TIMER(value)             (INTCTRL_SELL_TIMER_Msk & (_UINT32_(value) << INTCTRL_SELL_TIMER_Pos)) 
#define INTCTRL_SELL_CRYPTO_Pos               _UINT32_(16)                                         /* (INTCTRL_SELL Position) Crypto Interrupt 3 */
#define INTCTRL_SELL_CRYPTO_Msk               (_UINT32_(0xF) << INTCTRL_SELL_CRYPTO_Pos)           /* (INTCTRL_SELL Mask) CRYPTO */
#define INTCTRL_SELL_CRYPTO(value)            (INTCTRL_SELL_CRYPTO_Msk & (_UINT32_(value) << INTCTRL_SELL_CRYPTO_Pos)) 

/* -------- INTCTRL_APRL : (INTCTRL Offset: 0x30) (R/W 32) Interrupt Activation Polarity Register Low -------- */
#define INTCTRL_APRL_RESETVALUE               _UINT32_(0x00)                                       /*  (INTCTRL_APRL) Interrupt Activation Polarity Register Low  Reset Value */

#define INTCTRL_APRL_RTC_Pos                  _UINT32_(0)                                          /* (INTCTRL_APRL) RTC Interrupt Position */
#define INTCTRL_APRL_RTC_Msk                  (_UINT32_(0x1) << INTCTRL_APRL_RTC_Pos)              /* (INTCTRL_APRL) RTC Interrupt Mask */
#define INTCTRL_APRL_RTC(value)               (INTCTRL_APRL_RTC_Msk & (_UINT32_(value) << INTCTRL_APRL_RTC_Pos)) /* Assigment of value for RTC in the INTCTRL_APRL register */
#define INTCTRL_APRL_TAMPER_Pos               _UINT32_(1)                                          /* (INTCTRL_APRL) Tamper Interrupt Position */
#define INTCTRL_APRL_TAMPER_Msk               (_UINT32_(0x1) << INTCTRL_APRL_TAMPER_Pos)           /* (INTCTRL_APRL) Tamper Interrupt Mask */
#define INTCTRL_APRL_TAMPER(value)            (INTCTRL_APRL_TAMPER_Msk & (_UINT32_(value) << INTCTRL_APRL_TAMPER_Pos)) /* Assigment of value for TAMPER in the INTCTRL_APRL register */
#define INTCTRL_APRL_EXTDMA_Pos               _UINT32_(2)                                          /* (INTCTRL_APRL) External DMA Interrupt Position */
#define INTCTRL_APRL_EXTDMA_Msk               (_UINT32_(0x1) << INTCTRL_APRL_EXTDMA_Pos)           /* (INTCTRL_APRL) External DMA Interrupt Mask */
#define INTCTRL_APRL_EXTDMA(value)            (INTCTRL_APRL_EXTDMA_Msk & (_UINT32_(value) << INTCTRL_APRL_EXTDMA_Pos)) /* Assigment of value for EXTDMA in the INTCTRL_APRL register */
#define INTCTRL_APRL_WDOG_Pos                 _UINT32_(3)                                          /* (INTCTRL_APRL) Watch Dog Interrupt Position */
#define INTCTRL_APRL_WDOG_Msk                 (_UINT32_(0x1) << INTCTRL_APRL_WDOG_Pos)             /* (INTCTRL_APRL) Watch Dog Interrupt Mask */
#define INTCTRL_APRL_WDOG(value)              (INTCTRL_APRL_WDOG_Msk & (_UINT32_(value) << INTCTRL_APRL_WDOG_Pos)) /* Assigment of value for WDOG in the INTCTRL_APRL register */
#define INTCTRL_APRL_TAMPER_BUSY_Pos          _UINT32_(5)                                          /* (INTCTRL_APRL) Tamper Busy Interrupt Position */
#define INTCTRL_APRL_TAMPER_BUSY_Msk          (_UINT32_(0x1) << INTCTRL_APRL_TAMPER_BUSY_Pos)      /* (INTCTRL_APRL) Tamper Busy Interrupt Mask */
#define INTCTRL_APRL_TAMPER_BUSY(value)       (INTCTRL_APRL_TAMPER_BUSY_Msk & (_UINT32_(value) << INTCTRL_APRL_TAMPER_BUSY_Pos)) /* Assigment of value for TAMPER_BUSY in the INTCTRL_APRL register */
#define INTCTRL_APRL_TIMER0_Pos               _UINT32_(6)                                          /* (INTCTRL_APRL) Timer 0 Interrupt Position */
#define INTCTRL_APRL_TIMER0_Msk               (_UINT32_(0x1) << INTCTRL_APRL_TIMER0_Pos)           /* (INTCTRL_APRL) Timer 0 Interrupt Mask */
#define INTCTRL_APRL_TIMER0(value)            (INTCTRL_APRL_TIMER0_Msk & (_UINT32_(value) << INTCTRL_APRL_TIMER0_Pos)) /* Assigment of value for TIMER0 in the INTCTRL_APRL register */
#define INTCTRL_APRL_TIMER1_Pos               _UINT32_(7)                                          /* (INTCTRL_APRL) Timer 1 interrupt Position */
#define INTCTRL_APRL_TIMER1_Msk               (_UINT32_(0x1) << INTCTRL_APRL_TIMER1_Pos)           /* (INTCTRL_APRL) Timer 1 interrupt Mask */
#define INTCTRL_APRL_TIMER1(value)            (INTCTRL_APRL_TIMER1_Msk & (_UINT32_(value) << INTCTRL_APRL_TIMER1_Pos)) /* Assigment of value for TIMER1 in the INTCTRL_APRL register */
#define INTCTRL_APRL_PWRDOWN_Pos              _UINT32_(11)                                         /* (INTCTRL_APRL) Power Down Interrupt Position */
#define INTCTRL_APRL_PWRDOWN_Msk              (_UINT32_(0x1) << INTCTRL_APRL_PWRDOWN_Pos)          /* (INTCTRL_APRL) Power Down Interrupt Mask */
#define INTCTRL_APRL_PWRDOWN(value)           (INTCTRL_APRL_PWRDOWN_Msk & (_UINT32_(value) << INTCTRL_APRL_PWRDOWN_Pos)) /* Assigment of value for PWRDOWN in the INTCTRL_APRL register */
#define INTCTRL_APRL_MB_TX_Pos                _UINT32_(14)                                         /* (INTCTRL_APRL) Mailbox TX Interrupt Position */
#define INTCTRL_APRL_MB_TX_Msk                (_UINT32_(0x1) << INTCTRL_APRL_MB_TX_Pos)            /* (INTCTRL_APRL) Mailbox TX Interrupt Mask */
#define INTCTRL_APRL_MB_TX(value)             (INTCTRL_APRL_MB_TX_Msk & (_UINT32_(value) << INTCTRL_APRL_MB_TX_Pos)) /* Assigment of value for MB_TX in the INTCTRL_APRL register */
#define INTCTRL_APRL_MB_RX_Pos                _UINT32_(15)                                         /* (INTCTRL_APRL) Mailbox RX Interrupt Position */
#define INTCTRL_APRL_MB_RX_Msk                (_UINT32_(0x1) << INTCTRL_APRL_MB_RX_Pos)            /* (INTCTRL_APRL) Mailbox RX Interrupt Mask */
#define INTCTRL_APRL_MB_RX(value)             (INTCTRL_APRL_MB_RX_Msk & (_UINT32_(value) << INTCTRL_APRL_MB_RX_Pos)) /* Assigment of value for MB_RX in the INTCTRL_APRL register */
#define INTCTRL_APRL_CRYPTODMA_Pos            _UINT32_(16)                                         /* (INTCTRL_APRL) Crypto DMA Interrupt Position */
#define INTCTRL_APRL_CRYPTODMA_Msk            (_UINT32_(0x1) << INTCTRL_APRL_CRYPTODMA_Pos)        /* (INTCTRL_APRL) Crypto DMA Interrupt Mask */
#define INTCTRL_APRL_CRYPTODMA(value)         (INTCTRL_APRL_CRYPTODMA_Msk & (_UINT32_(value) << INTCTRL_APRL_CRYPTODMA_Pos)) /* Assigment of value for CRYPTODMA in the INTCTRL_APRL register */
#define INTCTRL_APRL_NDRNG_Pos                _UINT32_(17)                                         /* (INTCTRL_APRL) RNG Interrupt Position */
#define INTCTRL_APRL_NDRNG_Msk                (_UINT32_(0x1) << INTCTRL_APRL_NDRNG_Pos)            /* (INTCTRL_APRL) RNG Interrupt Mask */
#define INTCTRL_APRL_NDRNG(value)             (INTCTRL_APRL_NDRNG_Msk & (_UINT32_(value) << INTCTRL_APRL_NDRNG_Pos)) /* Assigment of value for NDRNG in the INTCTRL_APRL register */
#define INTCTRL_APRL_PKENGINE_Pos             _UINT32_(18)                                         /* (INTCTRL_APRL) PK Engine Interrupt Position */
#define INTCTRL_APRL_PKENGINE_Msk             (_UINT32_(0x1) << INTCTRL_APRL_PKENGINE_Pos)         /* (INTCTRL_APRL) PK Engine Interrupt Mask */
#define INTCTRL_APRL_PKENGINE(value)          (INTCTRL_APRL_PKENGINE_Msk & (_UINT32_(value) << INTCTRL_APRL_PKENGINE_Pos)) /* Assigment of value for PKENGINE in the INTCTRL_APRL register */
#define INTCTRL_APRL_Msk                      _UINT32_(0x0007C8EF)                                 /* (INTCTRL_APRL) Register Mask  */

#define INTCTRL_APRL_TIMER_Pos                _UINT32_(6)                                          /* (INTCTRL_APRL Position) Timer x Interrupt */
#define INTCTRL_APRL_TIMER_Msk                (_UINT32_(0x3) << INTCTRL_APRL_TIMER_Pos)            /* (INTCTRL_APRL Mask) TIMER */
#define INTCTRL_APRL_TIMER(value)             (INTCTRL_APRL_TIMER_Msk & (_UINT32_(value) << INTCTRL_APRL_TIMER_Pos)) 

/* -------- INTCTRL_ATRL : (INTCTRL Offset: 0x38) (R/W 32) Interrupt Activation Type Register Low -------- */
#define INTCTRL_ATRL_RESETVALUE               _UINT32_(0x00)                                       /*  (INTCTRL_ATRL) Interrupt Activation Type Register Low  Reset Value */

#define INTCTRL_ATRL_RTC_Pos                  _UINT32_(0)                                          /* (INTCTRL_ATRL) RTC Interrupt Position */
#define INTCTRL_ATRL_RTC_Msk                  (_UINT32_(0x1) << INTCTRL_ATRL_RTC_Pos)              /* (INTCTRL_ATRL) RTC Interrupt Mask */
#define INTCTRL_ATRL_RTC(value)               (INTCTRL_ATRL_RTC_Msk & (_UINT32_(value) << INTCTRL_ATRL_RTC_Pos)) /* Assigment of value for RTC in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_TAMPER_Pos               _UINT32_(1)                                          /* (INTCTRL_ATRL) Tamper Interrupt Position */
#define INTCTRL_ATRL_TAMPER_Msk               (_UINT32_(0x1) << INTCTRL_ATRL_TAMPER_Pos)           /* (INTCTRL_ATRL) Tamper Interrupt Mask */
#define INTCTRL_ATRL_TAMPER(value)            (INTCTRL_ATRL_TAMPER_Msk & (_UINT32_(value) << INTCTRL_ATRL_TAMPER_Pos)) /* Assigment of value for TAMPER in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_EXTDMA_Pos               _UINT32_(2)                                          /* (INTCTRL_ATRL) External DMA Interrupt Position */
#define INTCTRL_ATRL_EXTDMA_Msk               (_UINT32_(0x1) << INTCTRL_ATRL_EXTDMA_Pos)           /* (INTCTRL_ATRL) External DMA Interrupt Mask */
#define INTCTRL_ATRL_EXTDMA(value)            (INTCTRL_ATRL_EXTDMA_Msk & (_UINT32_(value) << INTCTRL_ATRL_EXTDMA_Pos)) /* Assigment of value for EXTDMA in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_WDOG_Pos                 _UINT32_(3)                                          /* (INTCTRL_ATRL) Watch Dog Interrupt Position */
#define INTCTRL_ATRL_WDOG_Msk                 (_UINT32_(0x1) << INTCTRL_ATRL_WDOG_Pos)             /* (INTCTRL_ATRL) Watch Dog Interrupt Mask */
#define INTCTRL_ATRL_WDOG(value)              (INTCTRL_ATRL_WDOG_Msk & (_UINT32_(value) << INTCTRL_ATRL_WDOG_Pos)) /* Assigment of value for WDOG in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_TAMPER_BUSY_Pos          _UINT32_(5)                                          /* (INTCTRL_ATRL) Tamper Busy Interrupt Position */
#define INTCTRL_ATRL_TAMPER_BUSY_Msk          (_UINT32_(0x1) << INTCTRL_ATRL_TAMPER_BUSY_Pos)      /* (INTCTRL_ATRL) Tamper Busy Interrupt Mask */
#define INTCTRL_ATRL_TAMPER_BUSY(value)       (INTCTRL_ATRL_TAMPER_BUSY_Msk & (_UINT32_(value) << INTCTRL_ATRL_TAMPER_BUSY_Pos)) /* Assigment of value for TAMPER_BUSY in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_TIMER0_Pos               _UINT32_(6)                                          /* (INTCTRL_ATRL) Timer 0 Interrupt Position */
#define INTCTRL_ATRL_TIMER0_Msk               (_UINT32_(0x1) << INTCTRL_ATRL_TIMER0_Pos)           /* (INTCTRL_ATRL) Timer 0 Interrupt Mask */
#define INTCTRL_ATRL_TIMER0(value)            (INTCTRL_ATRL_TIMER0_Msk & (_UINT32_(value) << INTCTRL_ATRL_TIMER0_Pos)) /* Assigment of value for TIMER0 in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_TIMER1_Pos               _UINT32_(7)                                          /* (INTCTRL_ATRL) Timer 1 interrupt Position */
#define INTCTRL_ATRL_TIMER1_Msk               (_UINT32_(0x1) << INTCTRL_ATRL_TIMER1_Pos)           /* (INTCTRL_ATRL) Timer 1 interrupt Mask */
#define INTCTRL_ATRL_TIMER1(value)            (INTCTRL_ATRL_TIMER1_Msk & (_UINT32_(value) << INTCTRL_ATRL_TIMER1_Pos)) /* Assigment of value for TIMER1 in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_PWRDOWN_Pos              _UINT32_(11)                                         /* (INTCTRL_ATRL) Power Down Interrupt Position */
#define INTCTRL_ATRL_PWRDOWN_Msk              (_UINT32_(0x1) << INTCTRL_ATRL_PWRDOWN_Pos)          /* (INTCTRL_ATRL) Power Down Interrupt Mask */
#define INTCTRL_ATRL_PWRDOWN(value)           (INTCTRL_ATRL_PWRDOWN_Msk & (_UINT32_(value) << INTCTRL_ATRL_PWRDOWN_Pos)) /* Assigment of value for PWRDOWN in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_MB_TX_Pos                _UINT32_(14)                                         /* (INTCTRL_ATRL) Mailbox TX Interrupt Position */
#define INTCTRL_ATRL_MB_TX_Msk                (_UINT32_(0x1) << INTCTRL_ATRL_MB_TX_Pos)            /* (INTCTRL_ATRL) Mailbox TX Interrupt Mask */
#define INTCTRL_ATRL_MB_TX(value)             (INTCTRL_ATRL_MB_TX_Msk & (_UINT32_(value) << INTCTRL_ATRL_MB_TX_Pos)) /* Assigment of value for MB_TX in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_MB_RX_Pos                _UINT32_(15)                                         /* (INTCTRL_ATRL) Mailbox RX Interrupt Position */
#define INTCTRL_ATRL_MB_RX_Msk                (_UINT32_(0x1) << INTCTRL_ATRL_MB_RX_Pos)            /* (INTCTRL_ATRL) Mailbox RX Interrupt Mask */
#define INTCTRL_ATRL_MB_RX(value)             (INTCTRL_ATRL_MB_RX_Msk & (_UINT32_(value) << INTCTRL_ATRL_MB_RX_Pos)) /* Assigment of value for MB_RX in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_CRYPTO0_Pos              _UINT32_(16)                                         /* (INTCTRL_ATRL) Crypto Interrupt 0 Position */
#define INTCTRL_ATRL_CRYPTO0_Msk              (_UINT32_(0x1) << INTCTRL_ATRL_CRYPTO0_Pos)          /* (INTCTRL_ATRL) Crypto Interrupt 0 Mask */
#define INTCTRL_ATRL_CRYPTO0(value)           (INTCTRL_ATRL_CRYPTO0_Msk & (_UINT32_(value) << INTCTRL_ATRL_CRYPTO0_Pos)) /* Assigment of value for CRYPTO0 in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_CRYPTO1_Pos              _UINT32_(17)                                         /* (INTCTRL_ATRL) Crypto Interrupt 1 Position */
#define INTCTRL_ATRL_CRYPTO1_Msk              (_UINT32_(0x1) << INTCTRL_ATRL_CRYPTO1_Pos)          /* (INTCTRL_ATRL) Crypto Interrupt 1 Mask */
#define INTCTRL_ATRL_CRYPTO1(value)           (INTCTRL_ATRL_CRYPTO1_Msk & (_UINT32_(value) << INTCTRL_ATRL_CRYPTO1_Pos)) /* Assigment of value for CRYPTO1 in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_CRYPTO2_Pos              _UINT32_(18)                                         /* (INTCTRL_ATRL) Crypto Interrupt 2 Position */
#define INTCTRL_ATRL_CRYPTO2_Msk              (_UINT32_(0x1) << INTCTRL_ATRL_CRYPTO2_Pos)          /* (INTCTRL_ATRL) Crypto Interrupt 2 Mask */
#define INTCTRL_ATRL_CRYPTO2(value)           (INTCTRL_ATRL_CRYPTO2_Msk & (_UINT32_(value) << INTCTRL_ATRL_CRYPTO2_Pos)) /* Assigment of value for CRYPTO2 in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_CRYPTO3_Pos              _UINT32_(19)                                         /* (INTCTRL_ATRL) Crypto Interrupt 3 Position */
#define INTCTRL_ATRL_CRYPTO3_Msk              (_UINT32_(0x1) << INTCTRL_ATRL_CRYPTO3_Pos)          /* (INTCTRL_ATRL) Crypto Interrupt 3 Mask */
#define INTCTRL_ATRL_CRYPTO3(value)           (INTCTRL_ATRL_CRYPTO3_Msk & (_UINT32_(value) << INTCTRL_ATRL_CRYPTO3_Pos)) /* Assigment of value for CRYPTO3 in the INTCTRL_ATRL register */
#define INTCTRL_ATRL_Msk                      _UINT32_(0x000FC8EF)                                 /* (INTCTRL_ATRL) Register Mask  */

#define INTCTRL_ATRL_TIMER_Pos                _UINT32_(6)                                          /* (INTCTRL_ATRL Position) Timer x Interrupt */
#define INTCTRL_ATRL_TIMER_Msk                (_UINT32_(0x3) << INTCTRL_ATRL_TIMER_Pos)            /* (INTCTRL_ATRL Mask) TIMER */
#define INTCTRL_ATRL_TIMER(value)             (INTCTRL_ATRL_TIMER_Msk & (_UINT32_(value) << INTCTRL_ATRL_TIMER_Pos)) 
#define INTCTRL_ATRL_CRYPTO_Pos               _UINT32_(16)                                         /* (INTCTRL_ATRL Position) Crypto Interrupt 3 */
#define INTCTRL_ATRL_CRYPTO_Msk               (_UINT32_(0xF) << INTCTRL_ATRL_CRYPTO_Pos)           /* (INTCTRL_ATRL Mask) CRYPTO */
#define INTCTRL_ATRL_CRYPTO(value)            (INTCTRL_ATRL_CRYPTO_Msk & (_UINT32_(value) << INTCTRL_ATRL_CRYPTO_Pos)) 

/* -------- INTCTRL_ITRL : (INTCTRL Offset: 0x40) (R/W 32) Interrupt Type register Low -------- */
#define INTCTRL_ITRL_RESETVALUE               _UINT32_(0x00)                                       /*  (INTCTRL_ITRL) Interrupt Type register Low  Reset Value */

#define INTCTRL_ITRL_RTC_Pos                  _UINT32_(0)                                          /* (INTCTRL_ITRL) RTC Interrupt Position */
#define INTCTRL_ITRL_RTC_Msk                  (_UINT32_(0x1) << INTCTRL_ITRL_RTC_Pos)              /* (INTCTRL_ITRL) RTC Interrupt Mask */
#define INTCTRL_ITRL_RTC(value)               (INTCTRL_ITRL_RTC_Msk & (_UINT32_(value) << INTCTRL_ITRL_RTC_Pos)) /* Assigment of value for RTC in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_TAMPER_Pos               _UINT32_(1)                                          /* (INTCTRL_ITRL) Tamper Interrupt Position */
#define INTCTRL_ITRL_TAMPER_Msk               (_UINT32_(0x1) << INTCTRL_ITRL_TAMPER_Pos)           /* (INTCTRL_ITRL) Tamper Interrupt Mask */
#define INTCTRL_ITRL_TAMPER(value)            (INTCTRL_ITRL_TAMPER_Msk & (_UINT32_(value) << INTCTRL_ITRL_TAMPER_Pos)) /* Assigment of value for TAMPER in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_EXTDMA_Pos               _UINT32_(2)                                          /* (INTCTRL_ITRL) External DMA Interrupt Position */
#define INTCTRL_ITRL_EXTDMA_Msk               (_UINT32_(0x1) << INTCTRL_ITRL_EXTDMA_Pos)           /* (INTCTRL_ITRL) External DMA Interrupt Mask */
#define INTCTRL_ITRL_EXTDMA(value)            (INTCTRL_ITRL_EXTDMA_Msk & (_UINT32_(value) << INTCTRL_ITRL_EXTDMA_Pos)) /* Assigment of value for EXTDMA in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_WDOG_Pos                 _UINT32_(3)                                          /* (INTCTRL_ITRL) Watch Dog Interrupt Position */
#define INTCTRL_ITRL_WDOG_Msk                 (_UINT32_(0x1) << INTCTRL_ITRL_WDOG_Pos)             /* (INTCTRL_ITRL) Watch Dog Interrupt Mask */
#define INTCTRL_ITRL_WDOG(value)              (INTCTRL_ITRL_WDOG_Msk & (_UINT32_(value) << INTCTRL_ITRL_WDOG_Pos)) /* Assigment of value for WDOG in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_TAMPER_BUSY_Pos          _UINT32_(5)                                          /* (INTCTRL_ITRL) Tamper Busy Interrupt Position */
#define INTCTRL_ITRL_TAMPER_BUSY_Msk          (_UINT32_(0x1) << INTCTRL_ITRL_TAMPER_BUSY_Pos)      /* (INTCTRL_ITRL) Tamper Busy Interrupt Mask */
#define INTCTRL_ITRL_TAMPER_BUSY(value)       (INTCTRL_ITRL_TAMPER_BUSY_Msk & (_UINT32_(value) << INTCTRL_ITRL_TAMPER_BUSY_Pos)) /* Assigment of value for TAMPER_BUSY in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_TIMER0_Pos               _UINT32_(6)                                          /* (INTCTRL_ITRL) Timer 0 Interrupt Position */
#define INTCTRL_ITRL_TIMER0_Msk               (_UINT32_(0x1) << INTCTRL_ITRL_TIMER0_Pos)           /* (INTCTRL_ITRL) Timer 0 Interrupt Mask */
#define INTCTRL_ITRL_TIMER0(value)            (INTCTRL_ITRL_TIMER0_Msk & (_UINT32_(value) << INTCTRL_ITRL_TIMER0_Pos)) /* Assigment of value for TIMER0 in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_TIMER1_Pos               _UINT32_(7)                                          /* (INTCTRL_ITRL) Timer 1 interrupt Position */
#define INTCTRL_ITRL_TIMER1_Msk               (_UINT32_(0x1) << INTCTRL_ITRL_TIMER1_Pos)           /* (INTCTRL_ITRL) Timer 1 interrupt Mask */
#define INTCTRL_ITRL_TIMER1(value)            (INTCTRL_ITRL_TIMER1_Msk & (_UINT32_(value) << INTCTRL_ITRL_TIMER1_Pos)) /* Assigment of value for TIMER1 in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_PWRDOWN_Pos              _UINT32_(11)                                         /* (INTCTRL_ITRL) Power Down Interrupt Position */
#define INTCTRL_ITRL_PWRDOWN_Msk              (_UINT32_(0x1) << INTCTRL_ITRL_PWRDOWN_Pos)          /* (INTCTRL_ITRL) Power Down Interrupt Mask */
#define INTCTRL_ITRL_PWRDOWN(value)           (INTCTRL_ITRL_PWRDOWN_Msk & (_UINT32_(value) << INTCTRL_ITRL_PWRDOWN_Pos)) /* Assigment of value for PWRDOWN in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_MB_TX_Pos                _UINT32_(14)                                         /* (INTCTRL_ITRL) Mailbox TX Interrupt Position */
#define INTCTRL_ITRL_MB_TX_Msk                (_UINT32_(0x1) << INTCTRL_ITRL_MB_TX_Pos)            /* (INTCTRL_ITRL) Mailbox TX Interrupt Mask */
#define INTCTRL_ITRL_MB_TX(value)             (INTCTRL_ITRL_MB_TX_Msk & (_UINT32_(value) << INTCTRL_ITRL_MB_TX_Pos)) /* Assigment of value for MB_TX in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_MB_RX_Pos                _UINT32_(15)                                         /* (INTCTRL_ITRL) Mailbox RX Interrupt Position */
#define INTCTRL_ITRL_MB_RX_Msk                (_UINT32_(0x1) << INTCTRL_ITRL_MB_RX_Pos)            /* (INTCTRL_ITRL) Mailbox RX Interrupt Mask */
#define INTCTRL_ITRL_MB_RX(value)             (INTCTRL_ITRL_MB_RX_Msk & (_UINT32_(value) << INTCTRL_ITRL_MB_RX_Pos)) /* Assigment of value for MB_RX in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_CRYPTO0_Pos              _UINT32_(16)                                         /* (INTCTRL_ITRL) Crypto Interrupt 0 Position */
#define INTCTRL_ITRL_CRYPTO0_Msk              (_UINT32_(0x1) << INTCTRL_ITRL_CRYPTO0_Pos)          /* (INTCTRL_ITRL) Crypto Interrupt 0 Mask */
#define INTCTRL_ITRL_CRYPTO0(value)           (INTCTRL_ITRL_CRYPTO0_Msk & (_UINT32_(value) << INTCTRL_ITRL_CRYPTO0_Pos)) /* Assigment of value for CRYPTO0 in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_CRYPTO1_Pos              _UINT32_(17)                                         /* (INTCTRL_ITRL) Crypto Interrupt 1 Position */
#define INTCTRL_ITRL_CRYPTO1_Msk              (_UINT32_(0x1) << INTCTRL_ITRL_CRYPTO1_Pos)          /* (INTCTRL_ITRL) Crypto Interrupt 1 Mask */
#define INTCTRL_ITRL_CRYPTO1(value)           (INTCTRL_ITRL_CRYPTO1_Msk & (_UINT32_(value) << INTCTRL_ITRL_CRYPTO1_Pos)) /* Assigment of value for CRYPTO1 in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_CRYPTO2_Pos              _UINT32_(18)                                         /* (INTCTRL_ITRL) Crypto Interrupt 2 Position */
#define INTCTRL_ITRL_CRYPTO2_Msk              (_UINT32_(0x1) << INTCTRL_ITRL_CRYPTO2_Pos)          /* (INTCTRL_ITRL) Crypto Interrupt 2 Mask */
#define INTCTRL_ITRL_CRYPTO2(value)           (INTCTRL_ITRL_CRYPTO2_Msk & (_UINT32_(value) << INTCTRL_ITRL_CRYPTO2_Pos)) /* Assigment of value for CRYPTO2 in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_CRYPTO3_Pos              _UINT32_(19)                                         /* (INTCTRL_ITRL) Crypto Interrupt 3 Position */
#define INTCTRL_ITRL_CRYPTO3_Msk              (_UINT32_(0x1) << INTCTRL_ITRL_CRYPTO3_Pos)          /* (INTCTRL_ITRL) Crypto Interrupt 3 Mask */
#define INTCTRL_ITRL_CRYPTO3(value)           (INTCTRL_ITRL_CRYPTO3_Msk & (_UINT32_(value) << INTCTRL_ITRL_CRYPTO3_Pos)) /* Assigment of value for CRYPTO3 in the INTCTRL_ITRL register */
#define INTCTRL_ITRL_Msk                      _UINT32_(0x000FC8EF)                                 /* (INTCTRL_ITRL) Register Mask  */

#define INTCTRL_ITRL_TIMER_Pos                _UINT32_(6)                                          /* (INTCTRL_ITRL Position) Timer x Interrupt */
#define INTCTRL_ITRL_TIMER_Msk                (_UINT32_(0x3) << INTCTRL_ITRL_TIMER_Pos)            /* (INTCTRL_ITRL Mask) TIMER */
#define INTCTRL_ITRL_TIMER(value)             (INTCTRL_ITRL_TIMER_Msk & (_UINT32_(value) << INTCTRL_ITRL_TIMER_Pos)) 
#define INTCTRL_ITRL_CRYPTO_Pos               _UINT32_(16)                                         /* (INTCTRL_ITRL Position) Crypto Interrupt 3 */
#define INTCTRL_ITRL_CRYPTO_Msk               (_UINT32_(0xF) << INTCTRL_ITRL_CRYPTO_Pos)           /* (INTCTRL_ITRL Mask) CRYPTO */
#define INTCTRL_ITRL_CRYPTO(value)            (INTCTRL_ITRL_CRYPTO_Msk & (_UINT32_(value) << INTCTRL_ITRL_CRYPTO_Pos)) 

/* -------- INTCTRL_PIN : (INTCTRL Offset: 0x48) ( R/ 32) Interrupt Pending IRQ Num -------- */
#define INTCTRL_PIN_RESETVALUE                _UINT32_(0x00)                                       /*  (INTCTRL_PIN) Interrupt Pending IRQ Num  Reset Value */

